// import { Comment } from '@cybersport/specifications'
//
// import { Route } from '../api'
// import db from '../db'
//
// const comments: Route<'comments'> = {
//   deleteCommentsIdLikes() {},
//
//   getComments(_req, res) {
//     const data = db.get('comments').value()
//     res.json({ data })
//   },
//
//   getCommentsCount() {},
//
//   patchComments() {},
//
//   postComments() {},
//
//   postCommentsIdRating() {},
// }
//
// export const defaultState: Comment[] = [
//   {
//     id: 0,
//     type: 'comments',
//
//     attributes: {
//       userId: 0,
//       objectType: 0,
//       objectId: 0,
//       text: 'Декой лишний',
//       createdAt: 1591630493,
//       status: 1,
//     },
//   },
//   {
//     id: 1,
//     type: 'comments',
//
//     attributes: {
//       userId: 1,
//       objectType: 0,
//       objectId: 0,
//       text:
//         'ЛЮДИ НЕ ПОНИМАЮТ ЕСЛИ БЫ НЕ ЗЕВС, то марик не был лучшим авп, Зевс на него орал играй с АВП играй су.. с АВП, и всегда задрачивал его, потому что, марик распи.. играл в доту2! То же самое он сделал с Гамбит когда Задрочи... их играть Кобл и они выиграли на нем 10 карты и выиграли 2 дримхака! и потом, Зевс опять их зад...л и они взяли Мажор!',
//       createdAt: 1591630493,
//       status: 1,
//     },
//   },
//   {
//     id: 2,
//     type: 'comments',
//
//     attributes: {
//       userId: 2,
//       objectType: 0,
//       objectId: 0,
//       text:
//         'Зевс, хороший игрок, но чрезвычайно переоцененный благодаря удаче и медийке. Все тимспики с ним, "это ну я хз, давайте попробуем фейк клауднайн", т.е. никакими выдающимися колами и тактиками там и не пахло. Он просто занимал место, капитана, которое нормальный игрок не может занимать (все помним Нико и его показатели) и обеспечивал мораль. Вспомним его кибершколу и уроки, было ужасно. Я скорее его поставлю как самого везучего игрока, который попадал в нужное время, в нужную команду. А марик стал топом благодаря, только своему таланту, кто там его заставлял и мотивировал не суть важно.',
//       createdAt: 1591630493,
//       status: 1,
//     },
//   },
//   {
//     id: 3,
//     type: 'comments',
//
//     attributes: {
//       userId: 3,
//       objectType: 0,
//       objectId: 0,
//       text:
//         'как то мало голосов у гуардиана, он все таки довольно долго тащил нави и занимал 2 место хлтв или люди обиделись на него за слабые последние результаты в составе?',
//       createdAt: 1591630493,
//       status: 1,
//     },
//   },
//   {
//     id: 4,
//     type: 'comments',
//
//     attributes: {
//       userId: 4,
//       objectType: 0,
//       objectId: 0,
//       text:
//         'маркелофф довольно долго тащил НаВи, Зевс довольно долго тащил НаВи, Симпл довольно долго тащит НаВи, и при этом у Марика и Симпла есть топ-1 ХЛТВ, и у всех трёх есть медийный образ, а у Гвардиана нет. Так что результаты по делу',
//       createdAt: 1591630493,
//       status: 1,
//     },
//   },
// ]
//
// export default comments
